In [69]:
import pandas as pd

In [70]:
df= pd.read_csv("/content/GoogleAds_DataAnalytics_Sales_Uncleaned.csv")

In [71]:
df.shape

(2600, 13)

In [72]:
df.columns

Index(['Ad_ID', 'Campaign_Name', 'Clicks', 'Impressions', 'Cost', 'Leads',
       'Conversions', 'Conversion Rate', 'Sale_Amount', 'Ad_Date', 'Location',
       'Device', 'Keyword'],
      dtype='object')

In [73]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2600 entries, 0 to 2599
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Ad_ID            2600 non-null   object
 1   Campaign_Name    2600 non-null   object
 2   Clicks           2488 non-null   float64
 3   Impressions      2546 non-null   float64
 4   Cost             2503 non-null   object
 5   Leads            2552 non-null   float64
 6   Conversions      2526 non-null   float64
 7   Conversion Rate  1974 non-null   float64
 8   Sale_Amount      2461 non-null   object
 9   Ad_Date          2600 non-null   object
 10  Location         2600 non-null   object
 11  Device           2600 non-null   object
 12  Keyword          2600 non-null   object
dtypes: float64(5), object(8)
memory usage: 264.2+ KB

In [74]:
df.isnull().sum()

Ad_ID                0
Campaign_Name        0
Clicks             112
Impressions         54
Cost                97
Leads               48
Conversions         74
Conversion Rate    626
Sale_Amount        139
Ad_Date              0
Location             0
Device               0
Keyword              0
dtype: int64

In [75]:
df['Clicks'].fillna(df['Clicks'].median(), inplace=True)
df.isnull().sum()

/tmp/ipython-input-3687773829.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Clicks'].fillna(df['Clicks'].median(), inplace=True)

Ad_ID                0
Campaign_Name        0
Clicks               0
Impressions         54
Cost                97
Leads               48
Conversions         74
Conversion Rate    626
Sale_Amount        139
Ad_Date              0
Location             0
Device               0
Keyword              0
dtype: int64

In [76]:
df[df['Impressions'].isnull()]

,Ad_ID,Campaign_Name,Clicks,Impressions,Cost,Leads,Conversions,Conversion Rate,Sale_Amount,Ad_Date,Location,Device,Keyword
114,A1114,Data Analytics Corse,91.0,NaN,$203.52,NaN,9.0,0.099,$1838,20-11-2024,hydrebad,DESKTOP,data analytics course
120,A1120,Data Anlytics Corse,117.0,NaN,$214.18,29.0,4.0,0.034,$1348,2024/11/23,hyderabad,MOBILE,learn data analytics
160,A1160,Data Anlytics Corse,160.0,NaN,$245.87,11.0,6.0,0.037,NaN,2024-11-05,Hyderbad,DESKTOP,analytics for data
210,A1210,Data Analytcis Course,199.0,NaN,$199.98,15.0,8.0,0.040,$1467,2024-11-08,HYDERABAD,tablet,data anaytics training
232,A1232,Data Anlytics Corse,101.0,NaN,$234.17,29.0,5.0,0.050,$1568,2024-11-27,hyderabad,mobile,data anaytics training
294,A1294,Data Anlytics Corse,90.0,NaN,$249.0,21.0,10.0,NaN,$1245,19-11-2024,hyderabad,mobile,data analytics course
398,A1398,Data Analytcis Course,163.0,NaN,$206.46,14.0,3.0,NaN,$1103,2024/11/12,HYDERABAD,tablet,learn data analytics
446,A1446,Data Analytcis Course,145.0,NaN,$236.03,24.0,8.0,NaN,$1220,17-11-2024,hydrebad,Desktop,online data analytic
468,A1468,DataAnalyticsCourse,181.0,NaN,$208.33,22.0,8.0,0.044,$1932,2024-11-05,HYDERABAD,Tablet,online data analytic
471,A1471,Data Anlytics Corse,83.0,NaN,$229.97,12.0,8.0,0.096,$2000,30-11-2024,Hyderbad,DESKTOP,analytics for data
561,A1561,Data Anlytics Corse,196.0,NaN,$206.31,24.0,8.0,0.051,$1426,2024/11/23,hyderabad,tablet,data analitics online
571,A1571,Data Anlytics Corse,147.0,NaN,$205.83,25.0,8.0,NaN,$1728,2024-11-02,hydrebad,desktop,data analytics course
574,A1574,DataAnalyticsCourse,173.0,NaN,$241.61,28.0,3.0,0.017,$1191,2024-11-13,hyderabad,TABLET,learn data analytics
580,A1580,Data Analytics Corse,192.0,NaN,$180.82,27.0,4.0,0.021,$1847,09-11-2024,hydrebad,MOBILE,data anaytics training
592,A1592,Data Analytcis Course,174.0,NaN,$227.96,25.0,5.0,0.029,$1566,2024-11-15,Hyderbad,Tablet,online data analytic
669,A1669,Data Anlytics Corse,163.0,NaN,NaN,11.0,3.0,0.018,$1819,2024-11-20,hydrebad,TABLET,data anaytics training
735,A1735,Data Anlytics Corse,144.0,NaN,$186.47,29.0,8.0,0.056,$1437,29-11-2024,hydrebad,Mobile,data analytics course
757,A1757,DataAnalyticsCourse,139.0,NaN,$234.85,11.0,8.0,NaN,$1398,2024-11-04,hyderabad,Desktop,data anaytics training
786,A1786,Data Analytics Corse,132.0,NaN,$219.44,17.0,3.0,0.055,$1949,2024/11/24,HYDERABAD,Desktop,learn data analytics
797,A1797,Data Anlytics Corse,122.0,NaN,$217.66,25.0,10.0,0.053,$1799,2024/11/26,Hyderbad,TABLET,data analitics online
805,A1805,Data Analytcis Course,188.0,NaN,$220.11,13.0,4.0,0.021,$1262,29-11-2024,hydrebad,TABLET,data analitics online
964,A1964,Data Anlytics Corse,134.0,NaN,$202.32,17.0,5.0,0.057,$1963,2024/11/23,HYDERABAD,tablet,data anaytics training
1088,A2088,Data Analytics Corse,131.0,NaN,$209.38,16.0,9.0,0.069,$1645,2024-11-12,hydrebad,Mobile,data analitics online
1105,A2105,Data Anlytics Corse,194.0,NaN,$217.93,29.0,NaN,NaN,$1457,2024/11/25,hydrebad,Mobile,data analytics course
1170,A2170,Data Anlytics Corse,167.0,NaN,$244.62,11.0,9.0,NaN,$1465,2024-11-10,Hyderbad,TABLET,data analitics online
1242,A2242,Data Anlytics Corse,177.0,NaN,$240.09,26.0,10.0,NaN,NaN,2024/11/08,Hyderbad,mobile,data anaytics training
1260,A2260,DataAnalyticsCourse,126.0,NaN,$201.56,27.0,10.0,0.079,$1122,2024-11-21,hyderabad,Desktop,analytics for data
1276,A2276,Data Analytcis Course,193.0,NaN,$199.27,13.0,9.0,NaN,$1612,08-11-2024,hydrebad,mobile,data analitics online
1340,A2340,Data Analytcis Course,178.0,NaN,$203.6,12.0,3.0,0.017,$1155,2024-11-02,HYDERABAD,tablet,analytics for data
1419,A2419,DataAnalyticsCourse,169.0,NaN,$180.58,30.0,7.0,0.049,$1661,2024-11-26,Hyderbad,mobile,data anaytics training
1422,A2422,Data Analytcis Course,185.0,NaN,$234.72,18.0,6.0,0.032,$1508,2024/11/27,HYDERABAD,DESKTOP,data analitics online
1432,A2432,Data Analytcis Course,93.0,NaN,$192.81,22.0,7.0,0.075,$1726,2024/11/18,hydrebad,Desktop,learn data analytics
1451,A2451,Data Analytcis Course,148.0,NaN,$214.26,21.0,8.0,NaN,$1629,2024/11/13,hyderabad,Tablet,data analitics online
1508,A2508,Data Analytics Corse,96.0,NaN,$232.87,NaN,10.0,0.053,$1162,2024/11/14,HYDERABAD,Mobile,learn data analytics
1597,A2597,Data Analytics Corse,139.0,NaN,$182.66,22.0,10.0,NaN,$1482,2024-11-24,HYDERABAD,DESKTOP,learn data analytics
1693,A2693,DataAnalyticsCourse,168.0,NaN,$196.79,22.0,8.0,0.051,$1666,2024/11/23,hydrebad,tablet,learn data analytics
1721,A2721,Data Anlytics Corse,107.0,NaN,$227.88,23.0,8.0,0.075,$1844,2024/11/08,HYDERABAD,Desktop,online data analytic
1723,A2723,DataAnalyticsCourse,186.0,NaN,$185.55,11.0,5.0,0.027,$1903,2024/11/16,hyderabad,Tablet,data analytics course
1735,A2735,DataAnalyticsCourse,85.0,NaN,$190.32,13.0,9.0,0.106,$1301,2024/11/07,hyderabad,desktop,data analitics online
1786,A2786,Data Anlytics Corse,114.0,NaN,$223.69,20.0,3.0,0.026,$1845,08-11-2024,HYDERABAD,DESKTOP,data anaytics training
1824,A2824,Data Analytics Corse,176.0,NaN,$191.11,11.0,4.0,0.059,$1107,2024/11/28,hydrebad,MOBILE,online data analytic
1826,A2826,DataAnalyticsCourse,80.0,NaN,$196.17,15.0,4.0,0.050,$1252,2024-11-08,Hyderbad,Desktop,learn data analytics
1900,A2900,Data Analytcis Course,185.0,NaN,$192.6,23.0,5.0,0.027,$1180,2024-11-01,HYDERABAD,desktop,learn data analytics
1948,A2948,Data Anlytics Corse,97.0,NaN,$184.76,25.0,10.0,0.103,NaN,14-11-2024,HYDERABAD,TABLET,data analitics online
2006,A3006,Data Analytcis Course,113.0,NaN,NaN,26.0,8.0,0.071,$1285,12-11-2024,hydrebad,mobile,data analytics course
2055,A3055,Data Analytcis Course,124.0,NaN,$209.92,15.0,4.0,0.032,NaN,2024-11-25,Hyderbad,desktop,data analitics online
2105,A3105,Data Analytics Corse,193.0,NaN,$238.8,20.0,5.0,0.040,$1327,2024-11-02,HYDERABAD,Mobile,data anaytics training
2140,A3140,DataAnalyticsCourse,82.0,NaN,NaN,30.0,8.0,0.098,$1511,17-11-2024,Hyderbad,DESKTOP,learn data analytics
2217,A3217,Data Analytcis Course,120.0,NaN,$214.76,29.0,5.0,0.042,$1926,2024-11-30,Hyderbad,Mobile,data anaytics training
2265,A3265,Data Anlytics Corse,193.0,NaN,$230.95,26.0,8.0,0.041,$1055,11-11-2024,HYDERABAD,Desktop,data analitics online
2353,A3353,DataAnalyticsCourse,139.0,NaN,$200.54,30.0,5.0,0.032,NaN,2024-11-01,Hyderbad,desktop,analytics for data
2392,A3392,Data Analytics Corse,108.0,NaN,$208.9,10.0,NaN,NaN,$1313,2024/11/29,HYDERABAD,desktop,learn data analytics
2437,A3437,DataAnalyticsCourse,183.0,NaN,$198.12,27.0,10.0,0.055,NaN,2024/11/22,Hyderbad,Mobile,data analytics course
2527,A3527,Data Analytcis Course,185.0,NaN,$208.41,25.0,3.0,0.047,$1006,2024-11-13,HYDERABAD,mobile,data anaytics training

In [77]:
df[['Impressions']]

      Impressions
0          4498.0
1          5107.0
2          4544.0
3          3185.0
4          3361.0
...           ...
2595       5344.0
2596       3211.0
2597       3808.0
2598       5853.0
2599       5453.0

[2600 rows x 1 columns]

In [78]:
df['Impressions'] = df['Impressions'].fillna(method='bfill')
df.isnull().sum()

/tmp/ipython-input-2704271507.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['Impressions'] = df['Impressions'].fillna(method='bfill')

Ad_ID                0
Campaign_Name        0
Clicks               0
Impressions          0
Cost                97
Leads               48
Conversions         74
Conversion Rate    626
Sale_Amount        139
Ad_Date              0
Location             0
Device               0
Keyword              0
dtype: int64

In [79]:
print(df.duplicated())

0       False
1       False
2       False
3       False
4       False
        ...
2595    False
2596    False
2597    False
2598    False
2599    False
Length: 2600, dtype: bool

In [80]:
df['Leads'].fillna(0, inplace=True)
df['Conversions'].fillna(0, inplace=True)

/tmp/ipython-input-2636075849.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Leads'].fillna(0, inplace=True)
/tmp/ipython-input-2636075849.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Conversions'].fillna(0, inplace=True)

In [81]:
df.isnull().sum()

Ad_ID                0
Campaign_Name        0
Clicks               0
Impressions          0
Cost                97
Leads                0
Conversions          0
Conversion Rate    626
Sale_Amount        139
Ad_Date              0
Location             0
Device               0
Keyword              0
dtype: int64

In [82]:
df['Ad_Date'] = pd.to_datetime(df['Ad_Date'], errors='coerce')

In [83]:
df['Device'] = df['Device'].str.lower().str.strip()

In [84]:
df['Location'] = df['Location'].str.lower().str.strip()

In [85]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2600 entries, 0 to 2599
Data columns (total 13 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Ad_ID            2600 non-null   object
 1   Campaign_Name    2600 non-null   object
 2   Clicks           2600 non-null   float64
 3   Impressions      2600 non-null   float64
 4   Cost             2503 non-null   object
 5   Leads            2600 non-null   float64
 6   Conversions      2600 non-null   float64
 7   Conversion Rate  1974 non-null   float64
 8   Sale_Amount      2461 non-null   object
 9   Ad_Date          893 non-null    datetime64[ns]
 10  Location         2600 non-null   object
 11  Device           2600 non-null   object
 12  Keyword          2600 non-null   object
dtypes: datetime64[ns](1), float64(5), object(7)
memory usage: 264.2+ KB

In [86]:
df.isnull().sum()

Ad_ID                 0
Campaign_Name         0
Clicks                0
Impressions           0
Cost                 97
Leads                 0
Conversions           0
Conversion Rate     626
Sale_Amount         139
Ad_Date            1707
Location              0
Device                0
Keyword               0
dtype: int64

In [87]:
df['Cost'] = df['Cost'].replace({r'\$': ''}, regex=True).astype(float)
df['Cost'] = df['Cost'].fillna(df['Cost'].median())

In [88]:
df['Sale_Amount'].fillna(0, inplace=True)

/tmp/ipython-input-750602619.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Sale_Amount'].fillna(0, inplace=True)

In [89]:
df['Conversion Rate'] = df['Conversions'] / df['Clicks']

In [90]:
df['Ad_Date'].fillna(method='bfill', inplace=True)

/tmp/ipython-input-2156876765.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Ad_Date'].fillna(method='bfill', inplace=True)
/tmp/ipython-input-2156876765.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['Ad_Date'].fillna(method='bfill', inplace=True)

In [91]:
df.isnull().sum()

Ad_ID              0
Campaign_Name      0
Clicks             0
Impressions        0
Cost               0
Leads              0
Conversions        0
Conversion Rate    0
Sale_Amount        0
Ad_Date            1
Location           0
Device             0
Keyword            0
dtype: int64

In [92]:
df.dropna(subset=['Ad_Date'], inplace=True)

In [93]:
df.isnull().sum()

Ad_ID              0
Campaign_Name      0
Clicks             0
Impressions        0
Cost               0
Leads              0
Conversions        0
Conversion Rate    0
Sale_Amount        0
Ad_Date            0
Location           0
Device             0
Keyword            0
dtype: int64

# New Section